#include <stdio.h>
#include <math.h>
#include <locale.h> 

int main() {
	setlocale(LC_ALL, "Rus");
	char figura[] = {'K', 'Q', 'R', 'E', 'H'};
	int K1[2], K2[2], d[] = {0, 0, 0, 0, 0}, i=0, j=0;
	char x, y, fg;
	printf("¬ведите расположение первой фигуры (a-h 1-8):\n");
	scanf_s(" %c%d", &x, 1, &K1[1]);
	printf("¬ведите расположение второй фигуры (a-h 1-8):\n");
	scanf_s(" %c%d", &y, 1, &K2[1]);
	printf("¬ведите название фигуры (король - K, королев - Q, ладь€ - R, слон - E, конь - H):\n");
	scanf_s(" %c", &fg, 1);

	K1[0] = (int)x - 96;
	K2[0] = (int)y - 96;
	
	if (abs(K1[0] - K2[0]) <= 1 && abs(K1[1] - K2[1]) <= 1) //условие дл€ корол€
		d[0] = 1;
	if (K1[0] - K2[0] == 0 || K1[1] - K2[1] == 0 || abs(K1[0] - K2[0]) == abs(K1[1] - K2[1])) //условие дл€ королевы
		d[1] = 1;
	if (K1[0] - K2[0] == 0 || K1[1] - K2[1] == 0) //условие дл€ ладьи 
		d[2] = 1;
	if (abs(K1[0] - K2[0]) == abs(K1[1] - K2[1])) //условие дл€ слона 
		d[3] = 1;
	if ((abs(K1[0] - K2[0]) == 2 && abs(K1[1] - K2[1]) == 1) || (abs(K1[0] - K2[0]) == 1 && abs(K1[1] - K2[1]) == 2)) // условие дл€ кон€
		d[4] = 1;

	while (i < 5) {
		if (fg == figura[i]) {
			if (d[i] == 1)
				printf("ƒа, может");
			else {
				if ((d[0] + d[1] + d[2] + d[3] + d[4]) == 0)
					printf("Ќикака€ фигура не может туда попасть за 1 ход");
				else{
					printf("Ќет, не может, туда может попасть: ");
					while (j < 5) {
						if (d[j] == 1)
							printf("%c ", figura[j]);
						j++;
					}
				}
			}
		}
		i++;
	}
	return 0;
}
